zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/MCXC161/startup_MCXC161.c
#define _vStackTop  __StackTop
#define _vStackBase __StackLimit

/*
 * Data section ROM and RAM addresses
 */
extern uint32_t __etext[];
extern uint32_t __data_start__[];
extern uint32_t __data_end__[];
extern uint32_t __bss_start__[];
extern uint32_t __bss_end__[];

#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)

//*****************************************************************************
#if defined(__cplusplus)
} // extern "C"
#endif //(__cplusplus)
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void (*const __Vectors[])(void);
#define __vector_table __Vectors
__attribute__((used, section(".isr_vector"))) void (*const __Vectors[])(void) = {
#elif defined(__MCUXPRESSO)
extern void (*const g_pfnVectors[])(void);
extern void *__Vectors __attribute__((alias("g_pfnVectors")));
#define __vector_table g_pfnVectors
__attribute__((used, section(".isr_vector"))) void (*const g_pfnVectors[])(void) = {
#elif defined(__ICCARM__)
extern void (*const __vector_table[])(void);
/* The vector table is not needed for initialization. */
extern void (*const __iar_init$$done[])(void) __attribute__((alias("__vector_table")));
__attribute__((used, section(".intvec"))) void (*const __vector_table[])(void) = {
#elif defined(__GNUC__)
extern void (*const __isr_vector[])(void);
#define __vector_table __isr_vector
__attribute__((used, section(".isr_vector"))) void (*const __isr_vector[])(void) = {
#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)
    // Core Level - CM23
    (void (*)())((uint32_t)_vStackTop), // The initial stack pointer
    Reset_Handler,                      // The reset handler

    NMI_Handler,                        // NMI Handler
    HardFault_Handler,                  // Hard Fault Handler
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    SVC_Handler,                        // SVCall Handler
    0,                                  // Reserved
    0,                                  // Reserved
    PendSV_Handler,                     // PendSV Handler
    SysTick_Handler,                    // SysTick Handler

    // Chip Level - MCXC161
    OR_IRQHandler,                    // 16: OR IRQ1 to IRQ53
    CMC_IRQHandler,                   // 17: Core Mode Controller interrupt
    DMA_CH0_IRQHandler,               // 18: DMA3_0_CH0 error or transfer complete
    DMA_CH1_IRQHandler,               // 19: DMA3_0_CH1 error or transfer complete
    DMA_CH2_IRQHandler,               // 20: DMA3_0_CH2 error or transfer complete
    DMA_CH3_IRQHandler,               // 21: DMA3_0_CH3 error or transfer complete
    Reserved22_IRQHandler,            // 22: Reserved interrupt
    Reserved23_IRQHandler,            // 23: Reserved interrupt
    Reserved24_IRQHandler,            // 24: Reserved interrupt
    Reserved25_IRQHandler,            // 25: Reserved interrupt
    ERM0_SINGLE_BIT_IRQHandler,       // 26: ERM Single Bit error interrupt
    ERM0_MULTI_BIT_IRQHandler,        // 27: ERM Multi Bit error interrupt
    FMU0_IRQHandler,                  // 28: Flash Management Unit interrupt
    Reserved29_IRQHandler,            // 29: Reserved interrupt
    MBC0_IRQHandler,                  // 30: MBC secure violation interrupt
    SCG0_IRQHandler,                  // 31: System Clock Generator interrupt
    SPC0_IRQHandler,                  // 32: System Power Controller interrupt
    TRNG0_IRQHandler,                 // 33: TRNG Interrupt or TRNG Error
    WUU0_IRQHandler,                  // 34: Wake Up Unit interrupt
    Reserved35_IRQHandler,            // 35: Reserved interrupt
    Reserved36_IRQHandler,            // 36: Reserved interrupt
    Reserved37_IRQHandler,            // 37: Reserved interrupt
    Reserved38_IRQHandler,            // 38: Reserved interrupt
    Reserved39_IRQHandler,            // 39: Reserved interrupt
    Reserved40_IRQHandler,            // 40: Reserved interrupt
    Reserved41_IRQHandler,            // 41: Reserved interrupt
    LPI2C0_IRQHandler,                // 42: Low-Power Inter Integrated Circuit 0 interrupt
    Reserved43_IRQHandler,            // 43: Reserved interrupt
    LPSPI0_IRQHandler,                // 44: Low-Power Serial Peripheral Interface 0 interrupt
    Reserved45_IRQHandler,            // 45: Reserved interrupt
    Reserved46_IRQHandler,            // 46: Reserved interrupt
    LPUART0_IRQHandler,               // 47: Low-Power Universal Asynchronous Receive/Transmit 0 interrupt
    LPUART1_IRQHandler,               // 48: Low-Power Universal Asynchronous Receive/Transmit 1 interrupt
    LPUART2_IRQHandler,               // 49: Low-Power Universal Asynchronous Receive/Transmit 2 interrupt
    LPUART3_IRQHandler,               // 50: Low-Power Universal Asynchronous Receive/Transmit 3 interrupt
    Reserved51_IRQHandler,            // 51: Reserved interrupt
    Reserved52_IRQHandler,            // 52: Reserved interrupt
    Reserved53_IRQHandler,            // 53: Reserved interrupt
    Reserved54_IRQHandler,            // 54: Reserved interrupt
    CTIMER0_IRQHandler,               // 55: Standard counter/timer 0 interrupt
    CTIMER1_IRQHandler,               // 56: Standard counter/timer 1 interrupt
    Reserved57_IRQHandler,            // 57: Reserved interrupt
    Reserved58_IRQHandler,            // 58: Reserved interrupt
    Reserved59_IRQHandler,            // 59: Reserved interrupt
    FLEXPWM0_RELOAD_ERROR_IRQHandler, // 60: FlexPWM0_reload_error interrupt
    FLEXPWM0_FAULT_IRQHandler,        // 61: FlexPWM0_fault interrupt
    FLEXPWM0_SUBMODULE0_IRQHandler,   // 62: FlexPWM0 Submodule 0 capture/compare/reload interrupt
    FLEXPWM0_SUBMODULE1_IRQHandler,   // 63: FlexPWM0 Submodule 1 capture/compare/reload interrupt
    FLEXPWM0_SUBMODULE2_IRQHandler,   // 64: FlexPWM0 Submodule 2 capture/compare/reload interrupt
    Reserved65_IRQHandler,            // 65: Reserved interrupt
    Reserved66_IRQHandler,            // 66: Reserved interrupt
    Reserved67_IRQHandler,            // 67: Reserved interrupt
    Reserved68_IRQHandler,            // 68: Reserved interrupt
    Reserved69_IRQHandler,            // 69: Reserved interrupt
    FREQME0_IRQHandler,               // 70: Frequency Measurement interrupt
    LPTMR0_IRQHandler,                // 71: Low Power Timer 0 interrupt
    Reserved72_IRQHandler,            // 72: Reserved interrupt
    VBAT0_IRQHandler,                 // 73: VBAT OSC32K ready interrupt
    RTC_IRQHandler,                   // 74: RTC alarm interrupt
    RTC_1HZ_IRQHandler,               // 75: RTC 1Hz interrupt
    WWDT0_IRQHandler,                 // 76: Windowed Watchdog Timer 0 interrupt
    WWDT1_IRQHandler,                 // 77: Windowed Watchdog Timer 1 interrupt
    ADC0_IRQHandler,                  // 78: Analog-to-Digital Converter 0 interrupt
    Reserved79_IRQHandler,            // 79: Reserved interrupt
    CMP0_IRQHandler,                  // 80: Comparator 0 interrupt
    Reserved81_IRQHandler,            // 81: Reserved interrupt
    Reserved82_IRQHandler,            // 82: Reserved interrupt
    Reserved83_IRQHandler,            // 83: Reserved interrupt
    Reserved84_IRQHandler,            // 84: Reserved interrupt
    Reserved85_IRQHandler,            // 85: Reserved interrupt
    Reserved86_IRQHandler,            // 86: Reserved interrupt
    GPIO0_IRQHandler,                 // 87: General Purpose Input/Output interrupt 0
    GPIO1_IRQHandler,                 // 88: General Purpose Input/Output interrupt 1
    GPIO2_IRQHandler,                 // 89: General Purpose Input/Output interrupt 2
    GPIO3_IRQHandler,                 // 90: General Purpose Input/Output interrupt 3
};                                     /* End of __vector_table */

#if defined(__MCUXPRESSO)
#if defined(ENABLE_RAM_VECTOR_TABLE)
extern void *__VECTOR_TABLE __attribute__((alias("g_pfnVectors")));
void (*__VECTOR_RAM[sizeof(g_pfnVectors) / 4])(void) __attribute__((aligned(128)));
unsigned int __RAM_VECTOR_TABLE_SIZE_BYTES = sizeof(g_pfnVectors);
#endif //(ENABLE_RAM_VECTOR_TABLE)

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__((section(".after_vectors.init_data"))) void data_init(unsigned int romstart,
                                                                    unsigned int start,
                                                                    unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int *pulSrc  = (unsigned int *)romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__((section(".after_vectors.init_bss"))) void bss_init(unsigned int start, unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;
#endif //(__MCUXPRESSO)

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
void Reset_Handler_C(void)
{
#if !defined(__NO_SYSTEM_INIT)
    SystemInit();
#endif //(__NO_SYSTEM_INIT)

